/* Літерал - це фіксоване значення, яке записане безпосередньо у коді. Літерали можуть бути числовими, рядковими, булевими тощо. Наприклад: */

42; // числовий літерал
('Hello'); // рядковий літерал
true; // булевий літерал

//!===============================================================
/* 
Вираз - це будь-яке дійсне обчислення, яке повертає значення. Вирази можуть бути числовими, логічними, рядковими тощо. Наприклад:
*/

5 + 3; // числовий вираз, повертає 8
'Hello' + ' ' + 'World'; // рядковий вираз, повертає "Hello World"

//!===============================================================
/* 
Інструкція в JavaScript - це команда, яку браузер виконує. Інструкції зазвичай завершуються крапкою з комою (;), хоча це не обов'язково. Інструкції можуть бути простими або складними. Наприклад:
*/

5 + 5;
let a = 5; // Проста інструкція
//!===============================================================

// awdahefjygawyjdgajwygajwygdawdawdaw

/* 
awdawdawd
awdawdawdaw
awdawdawdawd
awdawdawdawd
*/

// console.log(25);
// console.log(30);
// console.log(35);
// console.log(40);

// console.log('Hello world');
// console.log(10 + 10 + 10);
