/**
 * Напиши цикл for, який виводить у консоль браузера
 * числа за зростанням від a до b, але тільки якщо число кратне 5.
 */

// function showNumbers(a, b) {
//   for (let i = a; i <= b; i++) {
//     if (i % 5 === 0) console.log(i);
//   }
// }

// showNumbers(23, 70);

/*
 * Напиши скрипт, який підраховує суму всіх парних чисел,
 * які входять в діапазон чисел у змінних від min до max.
 * Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в ньому два парних числа - 2 і 4, їх сума 6.
 */

// function foo(min, max) {
//   let total = 0;

//   for (let i = min; i <= max; i++) {
//     if (i % 2 === 0) {
//       total += i;
//     }
//   }

//   return total;
// }

// foo(1, 15);

//!===============================================================

// Напиши цикл, який виведе на консоль числа від 1 до 10.

// Напиши цикл, який виведе на консоль парні числа від 1 до 20.

// Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.

// for (let i = 0; i < 10; i++) {
//   console.log(i);
// }

// for (let i = 1; i < 20; i++) {
//   if (i % 2 === 0) console.log(i);
// }
//!===============================================================

// let total = 0;

// for (let i = 0; i < 100; i++) {
//   total += i;
// }

// console.log(total);

//!========================================================
// 1. Напиши цикл, який обчислить факторіал числа, введеного користувачем
//    (наприклад, факторіал `!5 = 5 * 4 * 3 * 2 * 1`).

// !6 = 6 * 5 * 4 * 3 * 2 * 1 * 0;
// !6 = 24 * 5 * 6;

// function factorial(x) {
//   let result = 1;

//   for (let i = 1; i <= x; i++) {
//     result *= i;
//   }

//   console.log(result);
// }

// factorial(6);
