/**
 * Напиши скрипт, який підраховує суму всіх парних чисел у масиві.
 */
// const numbers = [1, 5, 8, 9, 12, 4, 15, 27, 30, 18, 14];

// function getTotal(arr) {
//   let total = 0;

//   for (const item of arr) {
//     if (item % 2 === 0) {
//       total += item;
//     }
//   }

//   console.log(total);
// }

// getTotal(numbers);
/**
 * Напиши скрипт, який виводить у консоль ім'я та телефонний номер користувача.
 * У змінних names та phones зберігаються рядки імен та телефонних номерів,
 * розділені комами. Порядковий номер імен та телефонів у рядках вказують на
 * відповідність. Кількість імен та телефонів гарантовано однакова.
 */

// const names = 'Jacob,William,Solomon,Artemis';
// const phones = '89001234567,89001112233,890055566377,890055566300';

// const namesArr = names.split(',');
// const phonesArr = phones.split(',');

// for (let i = 0; i < namesArr.length; i++) {
//   const name = namesArr[i];
//   const phone = phonesArr[i];
//   console.log(name, phone);
// }

/**
 * Напиши скрипт, який виводить у консоль усі слова рядка
 * крім першого і останнього. Результуючий рядок не повинен починатися
 * або закінчуватися символ пробілу.
 * Скрипт повинен працювати для будь-якого рядка.
 */

// const string = 'Welcome to the future';

// const result = string.split(' ').slice(1, -1).join(' ');

// console.log(result);
/**
 * Напиши скрипт пошуку найменшого числа у масиві. Код повинен працювати
 * для будь-якого масиву чисел. Використовуй цикл для розв'язання задачі.
 */

// const values = [17, 94, 23, 37];

// function getMin(arr) {
//   let min = arr[0];

//   for (const item of arr) {
//     if (item < min) {
//       min = item;
//     }
//   }

//   return min;
// }

// const min1 = getMin([1, 2, 4, 1, 32, 4, 6, 7, 7]);
// const min2 = getMin([25, 42, 3, 12, 43, 2, 23]);

// console.log(min2);

//!======================================================

const nums = [12, 35, 42, 34, 25, 23, 12, 22, 13, 23, 12, 34];

// Напиши функцію, яка приймає масив та виводить кожен елемент масиву у консоль.

// function showItems(arr) {
//   for (const item of arr) {
//     console.log(item);
//   }
// }

// showItems(nums);
//!======================================================
// Напиши функцію, яка приймає масив та виводить кожен парний елемент масиву у консоль.

// function task2(arr) {
//   for (let i = 1; i < arr.length; i += 2) {
//     console.log(arr[i]);
//   }
// }

// task2(nums);

//!======================================================
// Напиши функцію, яка приймає масив чисел та виводить лише парні числа у консоль.

// function task3(arr) {
//   const result = [];
//   for (const item of arr) {
//     if (item % 2 === 0) {
//       result.push(item);
//     }
//   }
//   console.log(result);
// }

// task3(nums);

//!======================================================
// Напиши функцію, яка приймає два параметри (arr, max). Де arr - це масив чисел. Потрібно вивести лише ті елементи масиву які більші за max.

// function task3(arr, max) {
//   const result = [];
//   for (const item of arr) {
//     if (item > max) result.push(item);
//   }
//   console.log(result);
// }
// task3([1, 24, 1, 2, 3, 45, 1, 2, 4], 1);

//!======================================================
// Напиши функцію яка приймає масив та повертає суму всіх чисел у масиві.

// function totalSalary(salaries) {
//   let total = 0;
//   for (const salary of salaries) {
//     total += salary;
//   }
//   console.log(total);
//   return total;
// }

// totalSalary(nums);

//!======================================================

// Напиши функцію яка приймає масив та елемент для пошуку. Фукнція повинна порахувати скільки разів шуканий елемент зустрічається у масиві.

// Напиши функцію яка приймає масив чисел. Функція повинна видалити усі негативні(відємні числа) з масиву та повернути новий масив.

// Напиши функцію яка приймає масив рядочків. Потрібно змінити кожен елемент масиву наступним чином - якщо довжина рядочку менша за 6 до привести рядок до нижнього регістру, в іншому випадку привести до верхнього регістру.

// Напиши функцію, яка приймає масив чисел і повертає новий масив, що містить лише непарні числа.

// Напиши функцію, яка приймає масив чисел і повертає новий масив, де кожне число помножене на індекс, за яким воно знаходиться в масиві.

// Напиши функцію, яка приймає масив чисел і повертає новий масив, що містить лише числа, які діляться на 3.

//!======================================================

// Напиши функцію яка приймає два масиви (arr1, arr2), та повертає новий масив де будуть лише ті елементи які зустрічаються і в arr1 і arr2.

// function task5(arr1, arr2) {
//   const result = [];
//   for (const item of arr1) {
//     if (arr2.includes(item)) {
//       result.push(item);
//     }
//   }

//   console.log(result);
// }

// task5([1, 4, 1, 23, 5, 2, 2, 3, 5], [1, 2, 3]);

//!======================================================
// Напиши функцію яка приймає два масиви (arr1, arr2), та повертає новий масив де будуть лише елементи масиву arr1 яких не має у масиві arr2.

// function task6(arr1, arr2) {
//   const result = [];
//   for (const item of arr1) {
//     if (!arr2.includes(item)) {
//       result.push(item);
//     }
//   }

//   console.log(result);
// }

// task6([1, 4, 1, 23, 5, 2, 2, 3, 5], [1, 2, 3]);

//!======================================================
// Напиши функцію яка приймає масив та знаходить мінімальний елемент.

// Напиши функцію яка приймає масив та знаходить максимальний елемент.
// function getMax(arr) {
//   let max = arr[0];

//   for (const item of arr) {
//     if (item > max) {
//       max = item;
//     }
//   }

//   return max;
// }

//!======================================================
// Напиши функцію яка приймає масив та повертає масив лише з тих елементів які більші за середнє значення всіх елементів масиву.

// function task7(arr) {
//   const result = [];
//   let avg = 0;

//   for (const item of arr) {
//     avg += item / arr.length;
//   }

//   for (const item of arr) {
//     if (item > avg) {
//       result.push(item);
//     }
//   }

//   console.log(result);
// }

// task7(nums);

//!======================================================
