/*
 * Напиши скрипт перевірки підписки користувача для доступу до контента
 * - Є три типа підписки: free, pro і vip.
 * - Отримати доступ можуть тільки користувачі pro і vip
 */

const subscription = 'free';

/*
 * Напиши скрипт, який перевіряє можливість відкрити чат з користувачем.
 * Для цього, користувач має бути:
 * - другом
 * - онлайн
 * - без режима не турбувати
 */

// const isOnline = true;
// const isFriend = true;
// const isDnd = true;

// const canOpenChat = ;
// console.log("Можна відкрити чат? ", canOpenChat);

/* 
    напиши скрипт, який вовидить ім'я юзера, за умови що у юзера є ім'я
    виконай завдання за допомогою логічного складання 
*/
// const userName = '';

// console.log('User name', userName);


/*
 - Напишіть код який буде описувати роботу світлофора
 - Якщо в значення приходить "red" - покажіть "Зараз горить червоний"
 - Якщо в значення приходить "orange" - покажіть "Зараз горить жовтий"
 - Якщо в значення приходить "green" - покажіть "Зараз горить зелений"
 - Інакше покажіть "Перехрестя не ругульоване"
*/
