// 1. Створіть змінну з ім'ям `name` і присвойте їй ваше ім'я. Виведіть це ім'я в
//    консоль.

// const userName = 'Volodymyr';
// console.log(userName);

// 2. Створіть змінну `age` і присвойте їй ваш вік. Виведіть в консоль рядок, що містить ваш вік у такому форматі: "Мені {вік} років".

// const age = 23;
// const message = `Мені ${age} років`;
// console.log(message);

// 3. Створіть змінні `x` і `y` і присвойте їм довільні числа. Виведіть в консоль результати додавання, віднімання, множення та ділення цих чисел.

// const x = 10;
// const y = 25;

// const res1 = `${x} + ${y} = ${x + y}`;
// const res2 = `${x} - ${y} = ${x - y}`;
// const res3 = `${x} * ${y} = ${x * y}`;
// const res4 = `${x} / ${y} = ${x / y}`;

// console.log(res1);
// console.log(res2);
// console.log(res3);
// console.log(res4);

// 4. Створіть змінну `city` і присвойте їй назву вашого міста. Створіть рядок,який містить "Я живу в місті {назва міста}", і виведіть його в консоль.

// const city = 'Dnipro';
// const message = `Я живу в місті ${city}`;
// console.log(message);

// 5. Створіть рядок з вашою електронною поштою. Використайте методи рядка, щоб
//    витягнути ваше ім'я та доменну частину. Виведіть обидва ці значення в
//    консоль.

// 6. Створіть змінну `price` і присвойте їй число. Створіть рядок, що містить ціну  з символом гривні, наприклад: "Ціна: 500 грн".

// const price = 500;
// const markup = `<p class="test">Ціна: ${price}грн</p>`;
// console.log(markup);

// 7. Створіть змінну `isLogged`, яка має булеве значення. Виведіть в консоль
//    повідомлення "Користувач авторизований", якщо `isLogged` дорівнює `true`, і
//    "Користувач неавторизований", якщо `isLogged` дорівнює `false`.

//!===============================================================

// ? awdawdawdwa
